Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Valid misfire policy for cron jobs are: `smart-policy`, `ignore-misfire-policy`, `fire-now` and `cron-trigger-do-nothing`. Valid misfire policy for interval jobs are: `smart-policy`, `ignore-misfire-policy`, `fire-now`, `simple-trigger-reschedule-now-with-existing-repeat-count`, `simple-trigger-reschedule-now-with-remaining-repeat-count`, `simple-trigger-reschedule-next-with-existing-count` and `simple-trigger-reschedule-next-with-remaining-count`.
ja_jp: cronジョブで有効な誤動作防止ポリシーは以下の通りです: `smart-policy`, `ignore-misfire-policy`, `fire-now` および `cron-trigger-do-nothing`. インターバルジョブで有効な誤動作防止ポリシーは次の通りです: `smart-policy` `ignore-misfire-policy`, `fire-now`, `simple-trigger-reschedule-now-with-existing-repeat-count`, `simple-trigger-reschedule-now-with-remaining-repeat-count`, `simple-trigger-reschedule-next-with-existing-count` および `simple-trigger-reschedule-next-with-remaining-count`.

source: Validate data coming to your REST endpoints
ja_jp: REST エンドポイントに送られるデータを検証

source: Validate that `foo` parameter is always present; e.g. `{#custom foo='bar' /}` is ok but `{#custom /}` results in a build failure.
ja_jp: `foo` パラメーターが常に存在することを検証します。たとえば、`{#custom foo='bar' /}` は問題ありませんが、`{#custom /}` はビルド時に失敗します。

source: Validate that deployment was successful
ja_jp: デプロイが成功したことの検証

source: Validate the chain's leaf certificate. If a common name of the leaf certificate is configured then a common name of the chain's leaf certificate must match it. Otherwise the chain's leaf certificate must also be avaiable in the truststore, unless one or more custom `TokenCertificateValidator` implementations are registered.
ja_jp: チェーンのリーフ証明書を検証します。リーフ証明書の共通名が設定されている場合は、チェーンのリーフ証明書の共通名がその共通名に一致する必要があります。それ以外の場合は、1 つ以上のカスタム `TokenCertificateValidator` 実装が登録されていない限り、チェーンのリーフ証明書もトラストストアで使用可能である必要があります。

source: Validate your persistent model
ja_jp: 永続モデルを検証

source: Validated against `org.acme.Foo`.
ja_jp: `org.acme.Foo` に対して検証されています。

source: Validation
ja_jp: バリデーション

source: Validation Error build items
ja_jp: バリデーションエラービルドアイテム

source: Validation and localization
ja_jp: バリデーションとローカリゼーション

source: Validation groups for REST endpoint or service method validation
ja_jp: RESTエンドポイントまたはサービスメソッドのバリデーショングループ

source: Validation has been enhanced with the following features:
ja_jp: バリデーションは以下の機能で強化された：

source: Validation modes and Hibernate Validator integration
ja_jp: バリデーションモードと Hibernate Validator の統合

source: Validation with Hibernate Validator
ja_jp: Hibernate Validatorによるバリデーション

source: ValidatorFactory and native executables
ja_jp: ValidatorFactoryとネイティブ実行可能ファイル

source: Value
ja_jp: 値

source: Value Examples
ja_jp: 値の例

source: Value Resolvers
ja_jp: 値リゾルバ

source: Value Spread Out Across Several Adjacent Lines
ja_jp: 複数の隣接する行にまたがる値

source: Value comes from the artifactId, from the `quarkus.application.name` property or from `quarkus.otel.resource.attributes=service.name=cart` property.
ja_jp: 値は、artifactId、 `quarkus.application.name` プロパティー、または `quarkus.otel.resource.attributes=service.name=cart` プロパティーから取得されます。

source: Value explanation
ja_jp: 値の説明

source: Value is a group id for a dependency identified by name `acme`.
ja_jp: 値 `acme` は、名前で識別される依存関係のグループ ID です。

source: Value is an artifact id for a dependency identified by name `acme`.
ja_jp: 値は、名前 `acme` で識別される依存関係のアーティファクト ID です。

source: Value range
ja_jp: 値の範囲

source: Value resolvers
ja_jp: 値リゾルバー

source: Value resolvers are used when evaluating expressions. A custom `io.quarkus.qute.ValueResolver` can be registered programmatically via `EngineBuilder.addValueResolver()`.
ja_jp: 式を評価する際に値リゾルバを使用します。カスタム `io.quarkus.qute.ValueResolver` は `EngineBuilder.addValueResolver()` からプログラムで登録することができます。

source: Value resolvers are used when evaluating expressions. First the resolvers that apply to the given `EvalContext` are filtered. Then the resolver with _highest priority_ is used to resolve the data. If a `io.quarkus.qute.Results.NotFound` object is returned then the next available resolver is used instead. However, `null` return value is considered a valid result.
ja_jp: 値リゾルバーは式を評価するときに使用されます。 まず、指定された `EvalContext` に適用されるリゾルバーがフィルタリングされます。 次に、_ 優先度が最も高い _ リゾルバーを使用してデータを解決します。 `io.quarkus.qute.Results.NotFound` オブジェクトが返された場合は、代わりに次の利用可能なリゾルバーが使用されます。 ただし、戻り値 `null` は有効な結果と見なされます。

source: Vanilla AppCDS generation
ja_jp: バニラAppCDSの生成

source: Variable `price` is not available outside the `let` section.
ja_jp: 変数 `price` は `let` セクションの外では利用できません。

source: Variables
ja_jp: 変数

source: Variables are not available outside the `let` section.
ja_jp: 変数は `let` セクションの外では利用できません。

source: Variables for Use in Documents
ja_jp: ドキュメントで使用する変数

source: Various CI environments provide a ready to use container-image registry which can be combined with the container-image Quarkus extensions in order to effortlessly create and push a Quarkus application to said registry.
ja_jp: さまざまな CI 環境では、Quarkus アプリケーションを作成してレジストリーをプッシュするために、コンテナーイメージ Quarkus エクステンションと組み合わせることで、すぐに使えるコンテナーイメージレジストリ-を利用できます。

source: Various Platform components were upgraded including:
ja_jp: 様々なプラットフォームコンポーネントがアップグレードされました。以下が含まれます。

source: Various Quarkus extensions contribute non-application endpoints that provide different kinds of information about the application. Examples of such extensions are the xref:smallrye-health.adoc[health], xref:telemetry-micrometer.adoc[metrics], xref:openapi-swaggerui.adoc[OpenAPI] and info extensions.
ja_jp: さまざまなQuarkusエクステンションが、アプリケーションに関するさまざまな情報を提供する非アプリケーションエンドポイントを提供しています。そのようなエクステンションの例として、 xref:smallrye-health.adoc[health] 、 xref:telemetry-micrometer.adoc[metrics] 、 xref:openapi-swaggerui.adoc[OpenAPI] 、infoエクステンションがあります。

source: Various improvements to the Dev Experience
ja_jp: 開発エクスペリエンスに関する様々な改善

source: Various usability improvements in extensions and our dev mode/testing infrastructure
ja_jp: エクステンションや開発モード/テストインフラにおける様々な利便性の向上

source: Varying database
ja_jp: データベースの切り替え

source: Verification
ja_jp: 検証

source: Verification key refresh
ja_jp: 検証キーの更新

source: Verify CSRF token in the application code
ja_jp: アプリケーションコード内のCSRFトークンの検証

source: Verify Maven is using the Java you expect
ja_jp: Maven が意図した Java を使用していることの確認

source: Verify access token indirectly by requesting UserInfo
ja_jp: UserInfo をリクエストすることでアクセストークンを間接的に検証する

source: Verify access token with UserInfo
ja_jp: UserInfo を使用したアクセストークンの検証

source: Verify access tokens indirectly by using them to request `UserInfo`.
ja_jp: アクセストークンを使用して `UserInfo` をリクエストすることで、アクセストークンを間接的に検証します。

source: Verify code flow access token
ja_jp: コードフローアクセストークンの検証

source: Verify pinning using tests
ja_jp: テストによるピン止めの検証

source: Verify that Maven is using the Java version you expect. If you have multiple JDKs installed, make sure Maven is using the expected one. You can verify which JDK Maven uses by running `mvn --version.`
ja_jp: Mavenが期待するJavaバージョンを使用していることを確認します。複数のJDKがインストールされている場合、Mavenが期待されるものを使用していることを確認してください。 `mvn --version.` を実行することで、Mavenが使用するJDKを確認することができます。

source: Verify that Maven is using the Java version you expect. If you have multiple JDKs installed, make sure Maven is using the expected one. You can verify which JDK Maven uses by running `mvn --version`.
ja_jp: Mavenが期待するJavaバージョンを使用していることを確認します。 複数のJDKがインストールされている場合、Mavenが期待されるものを使用していることを確認してください。Maven がどの JDK を使用しているかは、 `mvn --version` を実行することで確認できます。

source: Verify that an image stream and a service resource are created and the application is deployed by using the {openshift} web console.
ja_jp: {openshift}ウェブコンソールを使用して、イメージストリームとサービスリソースが作成され、アプリケーションがデプロイされていることを確認します。

source: Verify that an image stream and a service resource are created, and that the application is deployed. Use the {openshift} web console or the following {openshift} command-line interface (CLI) commands:
ja_jp: イメージストリームとサービスリソースが作成され、アプリケーションがデプロイされていることを確認します。{openshift} Web コンソールまたは以下の {openshift} コマンドラインインターフェース (CLI) コマンドを使用します:

source: Verify that the generated application still works after these changes:
ja_jp: これらの変更後に、生成されたアプリケーションが動作することを確認します。

source: Verify that you are enabling the right annotation processor! The Cassandra driver ships with its Object Mapper annotation processor, called `java-driver-mapper-processor`. But the Cassandra Quarkus extension also ships with its own annotation processor: `cassandra-quarkus-mapper-processor`, which has more capabilities than the driver's. This annotation processor is the only one suitable for use in a Quarkus application, so check that this is the one in use. Also, never use both annotation processors together.
ja_jp: 正しいアノテーション・プロセッサーを有効にしていることを確認してください！Cassandraドライバには、 `java-driver-mapper-processor` というObject Mapperアノテーション・プロセッサーが付属しています。しかし、Cassandra Quarkusエクステンションには、独自のアノテーション・プロセッサーも同梱されています： `cassandra-quarkus-mapper-processor `これは、ドライバーのものよりも多くの機能を備えています。このアノテーション・プロセッサーはQuarkusアプリケーションで使用するのに適した唯一のものなので、これが使用されているものであることを確認してください。また、両方のアノテーションプロセッサを一緒に使用しないでください。

source: Verify the quarkus-security-jpa dependency
ja_jp: quarkus-security-jpa 依存関係の確認

source: Verify whether the logs generated by the added library adhere to the same format as the other Quarkus logs.
ja_jp: 追加したライブラリによって生成されたログが、他のQuarkusログと同じ形式であるかどうかを確認してください。

source: Versatility
ja_jp: 多用途性

source: Version
ja_jp: バージョン

source: Version conflicts that occur when a user needs to use any other version than default or latest
ja_jp: ユーザーがデフォルトまたは最新以外のバージョンを使用する必要がある場合に発生するバージョンの競合

source: Version {graalvm-version} is required. Using the community edition is enough.
ja_jp: Version {graalvm-version} が必要です。コミュニティエディションで大丈夫です。

source: Vert.x 4 is coming soon! We are already working in Quarkus and the different satellite projects to migrate. With Vert.x 4, a new generator has been implemented (following the same code generation approach), paving the road to a smooth upgrade.
ja_jp: Vert.x 4が間もなく登場します!既にQuarkusと異なるサテライトプロジェクトで移行作業を行っています。Vert.x 4では、新しいジェネレータが実装されており(同じコード生成アプローチを踏襲しています)、スムーズなアップグレードへの道が開かれています。

source: Vert.x : the underlying reactive engine of Quarkus. The extension allows accessing to the managed Vert.x instance, as well as its Mutiny variant (exposing the Vert.x API using Mutiny types)
ja_jp: Vert.x：Quarkusの基礎となるリアクティブエンジンです。このエクステンションにより、マネージドVert.xインスタンスおよびそのMutiny版（Mutiny型を使用してVert.x APIを公開）にアクセスできます。

source: Vert.x APIs often rely on JSON. Vert.x provides two convenient classes to manipulate JSON document: `io.vertx.core.json.JsonObject` and `io.vertx.core.json.JsonArray`.
ja_jp: Vert.xのAPIはしばしばJSONに依存しています。Vert.xは、JSONドキュメントを操作する2つの便利なクラスを提供しています： `io.vertx.core.json.JsonObject` および `io.vertx.core.json.JsonArray` 。

source: Vert.x AsyncFile, which can be in full, or partial
ja_jp: Vert.x AsyncFile (完全または部分的)

source: Vert.x Axle and RX Java managed instances gone
ja_jp: Vert.x AxleとRXのJavaマネージドインスタンスの削除

source: Vert.x Axle and RX Java managed instances have been dropped.
ja_jp: Vert.x AxleとRX Javaのマネージドインスタンスを削除しました。

source: Vert.x Integration
ja_jp: Vert.x インテグレーション

source: Vert.x MDC data (e.g. 'traceId' for OpenTelemetry)
ja_jp: Vert.x Mapped Diagnostic Context ( MDC ) データ ( OpenTelemetry の 'traceId' など)

source: Vert.x OIDC is `stateful` and some users may assume that, therefore, Vert.x OIDC does not use cookies. It is not the case: it uses an opaque session cookie to track both the authorization code flow progress and the authenticated user session.
ja_jp: Vert.x OIDC は `stateful` (ステートフル) であるため、Vert.x OIDC はクッキーを使用しないと一部のユーザーは考えるかもしれません。しかし、そうではありません。認可コードフローの進行状況と認証済みユーザーセッションの両方を追跡するために、不透明なセッションクッキーを使用します。

source: Vert.x OIDC on Quarkus
ja_jp: Quarkus 上の Vert.x OIDC

source: Vert.x OIDC on Vert.x
ja_jp: Vert.x 上の Vert.x OIDC

source: Vert.x Redis Client
ja_jp: Vert.x Redis クライアント

source: Vert.x Reference Guide
ja_jp: Vert.x リファレンスガイド

source: Vert.x Routing Context Internal Data
ja_jp: Vert.x Routing Context の内部データ

source: Vert.x _duplicated context_ is a construct that provides the same kind of propagation but for asynchronous processing. It can also be used with synchronous code.
ja_jp: Vert.xの _複製コンテキスト_ は、同じような伝搬を提供する構造体ですが、非同期処理用です。同期コードでも使用できます。

source: Vert.x `JsonObject` and `JsonArray` instances bypass the serialization and deserialization mechanisms. Messages are sent as text messages.
ja_jp: Vert.x の `JsonObject` および `JsonArray` インスタンスは、シリアライゼーションおよびデシリアライゼーションのメカニズムをバイパスします。 メッセージはテキストメッセージとして送信されます。

source: Vert.x also supports streams thanks to the `ReadStream` and `WriteStream` classes. A `ReadStream` represents a stream of data you can read. So you can attach a callback invoked on every item traversing the stream. A `WriteStream` is a data source. You can push items to a `WriteStream.` These items will be consumed by a `ReadStream`:
ja_jp: Vert.x は `ReadStream` と `WriteStream` クラスのおかげでストリームもサポートしています。 `ReadStream` は読み込み可能なデータのストリームを表します。そのため、ストリームを通過するすべての項目で呼び出されるコールバックをアタッチすることができます。 `WriteStream` はデータソースです。アイテムを `WriteStream.` にプッシュすることができます。 これらのアイテムは `ReadStream` によって消費されます。

source: Vert.x and Netty are both at the core of Quarkus and have been upgraded respectively to 4.3.2 and 4.1.78.
ja_jp: Vert.xとNettyはどちらもQuarkusの中核であり、それぞれ4.3.2と4.1.78にアップグレードされています。

source: Vert.x based Websockets
ja_jp: Vert.xベースのWebsockets

source: Vert.x comes with a built-in https://vertx.io/docs/vertx-core/java/#event_bus[event bus] that you can use from your Quarkus application. So, your application components (CDI beans, resources...) can interact using asynchronous events, thus promoting loose-coupling.
ja_jp: Vert.xには、Quarkusアプリケーションから使用できる link:https://vertx.io/docs/vertx-core/java/#event_bus[イベントバス]が組み込まれています。そのため、アプリケーションコンポーネント（CDI Bean、リソース...）は、非同期イベントを使用して相互に作用することができ、疎結合を促進します。

source: Vert.x is a toolkit to build reactive applications and systems. It provides a huge ecosystem of libraries following the reactive principles (i.e., non-blocking and asynchronous). Vert.x is an essential part of Quarkus, as it provides its reactive capabilities.
ja_jp: Vert.xは、リアクティブなアプリケーションやシステムを構築するためのツールキットです。Vert.xは、リアクティブな原則（ノンブロッキングおよび非同期）に従ったライブラリの巨大なエコシステムを提供します。Vert.xは、リアクティブ機能を提供するため、Quarkusの重要な部分となっています。

source: Vert.x is at the core of Quarkus.
ja_jp: Vert.xはQuarkusの中核です。

source: Vert.x is capable of using https://netty.io/wiki/native-transports.html[Netty's native transports], which offers performance improvements on specific platforms.To enable them, you must include the appropriate dependency for your platform. It's usually a good idea to have both to keep your application platform agnostic. Netty is smart enough to use the correct one, that includes none at all on unsupported platforms:
ja_jp: Vert.xは link:https://netty.io/wiki/native-transports.html[Nettyのネイティブトランスポート]を使用することができ、特定のプラットフォームでパフォーマンスを向上させることができます。これらを有効にするには、お使いのプラットフォームに適切な依存関係を含める必要があります。これらを有効にするには、プラットフォームに適した依存関係を含める必要があります。通常、アプリケーションをプラットフォームに依存しないようにするためには、両方を持つことが良いアイデアです。Nettyは賢いので、サポートされていないプラットフォームでは一切使用しないなど、適切な方を使用します。

source: Vert.x is capable of using https://netty.io/wiki/native-transports.html[Netty's native transports], which offers performance improvements on specific platforms.To enable them, you must include the appropriate dependency for your platform. It's usually a good idea to have both to keep your application platform-agnostic. Netty is smart enough to use the correct one, that includes none at all on unsupported platforms:
ja_jp: Vert.x は https://netty.io/wiki/native-transports.html[Nettyのネイティブトランスポート] を使用することができます。これは特定のプラットフォームでパフォーマンスを向上させます。これらを有効にするには、お使いのプラットフォームに適切な依存関係を含める必要があります。通常、アプリケーションをプラットフォームに依存しないようにするために、両方を持つことは良い考えです。Nettyは賢いので、サポートされていないプラットフォームでは全く使用しないことも含めて、正しい方を使用します。

source: Vert.x is capable of using https://netty.io/wiki/native-transports.html[Netty's native transports], which offers performance improvements on specific platforms. To enable them, you must include the appropriate dependency for your platform. It's usually a good idea to have both to keep your application platform-agnostic. Netty is smart enough to use the correct one, that includes none at all on unsupported platforms:
ja_jp: Vert.xでは、 link:https://netty.io/wiki/native-transports.html[Nettyのネイティブトランスポート] を使用することができ、特定のプラットフォームでパフォーマンスが向上します。 これを有効にするには、プラットフォームに適した依存関係を含める必要があります。 通常、アプリケーションをプラットフォームに依存しないようにするためには、両方用意するのがよいでしょう。 Netty は賢いので、未対応のプラットフォームには全く依存しないなど、正しい方を使用します：

source: Vert.x provides multiple APIs. Let's focus on the "bare" one for now.
ja_jp: Vert.xは複数のAPIを提供しています。ここでは「素」のものに注目してみましょう。

source: Vert.x reactive routes now show a clickable codelens, that will open the browser to the configured URL, similar to JAX-RS endpoints:
ja_jp: Vert.xリアクティブ・ルートは、JAX-RSエンドポイントと同様に、設定されたURLへのブラウザを開く、クリック可能なコードレーンを表示するようになりました：

source: Vert.x reactive routes, JAX-RS and Renarde endpoints are now shown as implicitly used, as well as Quarkus `@BuildStep`-annotated classes and `@Observer`-annotated methods.
ja_jp: Vert.xリアクティブルート、JAX-RS、Renardeエンドポイントが暗黙的に使用されるようになり、Quarkus `@BuildStep` -注釈付きクラス、 `@Observer` -注釈付きメソッドも表示されるようになりました。

source: Vert.x streams do not implement Reactive Streams. Vert.x provides a different back-pressure protocol.
ja_jp: Vert.x ストリームは、Reactive Streams を実装していません。Vert.x は別のバックプレッシャープロトコルを提供します。

source: Vert.x web will create a new duplicated context for each http web request; Quarkus REST will mark such contexts as safe. Other extensions should follow a similar pattern when they are setting up a new context that is safe to be used for a local context guaranteeing sequential use, non-concurrent access, and scoped to the current reactive chain as a convenience not to have to pass a "context" object along explicitly.
ja_jp: Vert.x Web は、各 http Web リクエストに対して新しい複製コンテキストを作成します。Quarkus REST は、そのようなコンテキストに対し、安全であることをマークします。 他のエクステンションも、ローカルコンテキストに安全に使用できる新しいコンテキストを設定する際は、同様のパターンに従う必要があります。そうすることで、コンテキストは順番に使用され、同時にアクセスされません。また、現在のリアクティブチェーンにスコープ指定され、コンテキストオブジェクトを明示的に渡す必要がなくなり、利便性が向上します。

source: Very often, when your application secure space is wider than a single URL, you have to add a redirect-path property to support OIDC providers requiring that only specific callback URLs can be registered, for example: `quarkus.oidc.authentication.redirect-path=/callback`.
ja_jp: アプリケーションのセキュアな領域が単一の URL よりも広い場合、特定のコールバック URL のみが登録可能であることを要求する OIDC プロバイダーをサポートするために、多くの場合 redirect-path プロパティーを追加する必要があります (例: `quarkus.oidc.authentication.redirect-path=/callback`)。

source: Very similarly, Quarkus allows extensions authors to register a `NativeImageProxyDefinitionBuildItem`. An example of doing so is:
ja_jp: 同様に、Quarkus では、エクステンションの作成者が `NativeImageProxyDefinitionBuildItem` を登録することができます。その例としては、以下のようなものがあります。

source: Via annotations
ja_jp: アノテーション経由

source: Via the `@io.quarkus.hibernate.orm.PersistenceUnit` package-level annotation.
ja_jp: `@io.quarkus.hibernate.orm.PersistenceUnit` パッケージレベルのアノテーションを使用します。

source: Via the `packages` configuration property;
ja_jp: `packages` 設定プロパティーを使用します;

source: Video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem.
ja_jp: Quarkus開発者が主催するビデオポッドキャストで、Quarkusのエコシステムで起こっていること、その周辺について紹介しています。

source: Videos
ja_jp: ビデオ

source: View the configuration of the _Service_ object:
ja_jp: _Service_ オブジェクトの設定を表示します。

source: View the https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Getting Started Guide] for deploying a lambda with AWS CLI. Specifically, make sure you have created an `Execution Role`. You will need to define a `LAMBDA_ROLE_ARN` environment variable in your profile or console window, Alternatively, you can edit the `manage.sh` script that is generated by the build and put the role value directly there:
ja_jp: AWS CLIを使った Lambda のデプロイ方法については、 link:https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Getting Started Guide] を参照してください。具体的には、 `Execution Role` を作成していることを確認してください。プロファイルやコンソールウィンドウで `LAMBDA_ROLE_ARN` 環境変数を定義する必要があります。また、ビルドで生成される `manage.sh` スクリプトを編集して、そこに直接ロール値を置くこともできます。

source: Villain Service
ja_jp: ヴィラン・サービス

source: Villain service: http://localhost:8084[http://localhost:8084^]
ja_jp: ヴィラン・サービス: link:http://localhost:8084[： http://localhost:8084, window=_blank]

source: Virtual Method Example
ja_jp: 仮想メソッドの例

source: Virtual Methods
ja_jp: 仮想メソッド

source: Virtual Thread support reference
ja_jp: 仮想スレッドサポートリファレンス

source: Virtual Threads
ja_jp: 仮想スレッド

source: Virtual Threads support
ja_jp: Virtual Thread サポート

source: Virtual method parameters can be "nested" virtual method invocations.
ja_jp: 仮想メソッドのパラメーターは、「入れ子」仮想メソッドの呼び出しにすることができます。

source: Virtual methods are usually evaluated by value resolvers generated for <<template_extension_methods,@TemplateExtension methods>>, <<template_data,@TemplateData>> or classes used in <<typesafe_expressions,parameter declarations>>. However, a custom value resolver that is not backed by any Java class/method can be registered as well.
ja_jp: 仮想メソッドは通常、 <<template_extension_methods,@TemplateExtension メソッド>> 、 <<template_data,@TemplateData>> または <<typesafe_expressions,パラメーター宣言>> で使用されるクラス用に生成された値リゾルバーによって評価されます。しかし、どの Java クラス/メソッドにもバックアップされていないカスタム値リゾルバーを登録することも可能です。

source: Virtual methods are usually evaluated by value resolvers generated for xref:template_extension_methods[@TemplateExtension methods], xref:template_data[@TemplateData] or classes used in xref:typesafe_expressions[parameter declarations]. However, a custom value resolver that is not backed by any Java class/method can be registered as well.
ja_jp: 仮想メソッドは通常、 xref:template_extension_methods[@TemplateExtensionメソッド] 、 xref:template_data[@TemplateData] または xref:typesafe_expressions[パラメータ宣言] で使用されるクラス用に生成された値リゾルバーによって評価されます。ただし、Javaのクラス/メソッドに依存しないカスタム値リゾルバーも登録可能です。

source: Virtual thread
ja_jp: 仮想スレッド

source: Virtual thread metrics
ja_jp: 仮想スレッドメトリクス

source: Virtual thread names
ja_jp: 仮想スレッド名

source: Virtual thread support
ja_jp: 仮想スレッドのサポート

source: Virtual threads are a feature available since Java 19 (Java 21 is the first LTS version including virtual threads), aiming at providing a cheap alternative to platform threads for I/O-bound workloads.
ja_jp: 仮想スレッドは、Java 19 から利用可能な機能で (Java 21 は、仮想スレッドを含む最初の LTS バージョン)、 I/O バウンドのワークロードに対して、プラットフォームスレッドの安価な代替を提供することを目的としています。

source: Virtual threads are a feature available since Java 19 aiming at providing a cheap alternative to platform threads for I/O-bound workloads.
ja_jp: 仮想スレッドはI/Oバウンドワークロードのためのプラットフォームスレッドの安価な代替を提供することを目的としたJava 19から利用可能な機能です。

source: Virtual threads are created without a thread name by default, which is not practical to identify the execution for debugging and logging purposes. Quarkus managed virtual threads are named and prefixed with `quarkus-virtual-thread-`. You can customize this prefix, or disable the naming altogether configuring an empty value:
ja_jp: 仮想スレッドは、デフォルトではスレッド名なしで作成されます。これは、デバッグやロギング目的で実行を識別するためには実用的ではありません。 Quarkus の管理対象仮想スレッドには名前が付けられ、 `quarkus-virtual-thread-` というプレフィックスが付けられます。 このプレフィックスはカスタマイズすることも、空の値を設定して命名を完全に無効にすることもできます。

source: Virtual threads are still an experimental feature, you need to start your application with the `--enable-preview` flag:
ja_jp: 仮想スレッドはまだ実験的な機能なので、 `--enable-preview` フラグを付けてアプリケーションを起動する必要があります:

source: Virtual threads are useful for I/O-bound workloads only
ja_jp: 仮想スレッドはI/Oバウンドワークロードにのみに有効
